
членсписка(Элемент, [Элемент|_Хвост]).
членсписка(Элемент, [_Голова|Хвост]):-
    членсписка(Элемент, Хвост).


удалить_дубликат([], []):-!.
удалить_дубликат([X|Xs], Ys):-
      членсписка(X, Xs),
      !, удалить_дубликат(Xs, Ys).
удалить_дубликат([X|Xs], [X|Ys]):-
%     \+ членсписка(X, Xs),
      !, удалить_дубликат(Xs, Ys).

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%        
% База знаний "класс заболевания - симптом"

заболевание_для_кардиолога(Симптомы):-
    членсписка(гипертония, Симптомы),
	членсписка("отек на двух ногах", Симптомы).

орви(Симптомы) :-
    членсписка(кашель, Симптомы);
    членсписка(насморк, Симптомы);
    членсписка(высокаяТемпература, Симптомы).

выпискарецепта(Симптомы):-
    членсписка(рецепт,Симптомы).

аллергия(Симптомы):-
	членсписка("отёчность_лица", Симптомы),
	\+ членсписка("расширение поверхностных вен нижних конечностей у пациента или в семейном намнезе",Симптомы),
	\+ членсписка("отек на ноге", Симптомы).

заболевание_для_флеболога_или_хирурга(Симптомы):-
	членсписка("отек на ноге", Симптомы);
	членсписка("расширение поверхностных вен нижних конечностей у пациента или в семейном намнезе",Симптомы).
	
заболевание_для_терапевта(Симптомы):-
	членсписка("принимает препараты из группы БКК",Симптомы).
	
заболевание_для_нефролога(Симптомы):-
	членсписка("отеки постоянные/не проходят после сна и отдыха", Симптомы),
	членсписка("отечность лица",Симптомы).



%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% База знаний "врач - класс заболевания"

аллерголог(Симптомы, аллерголог):-
	аллергия(Симптомы).

кардиолог(Симптомы, кардиолог):-
    заболевание_для_кардиолога(Симптомы).

терапевт(Симптомы, терапевт):-
    орви(Симптомы);
    выпискарецепта(Симптомы);
	заболевание_для_терапевта(Симптомы).

регистратура(Симптомы, регистратура):-
    выпискарецепта(Симптомы).
	
нефролог(Симптомы, нефролог):-
	заболевание_для_нефролога(Симптомы).
	
флеболог(Симптомы, флеболог):-
	заболевание_для_флеболога_или_хирурга(Симптомы).

хирург(Симптомы, хирург):-
	заболевание_для_флеболога_или_хирурга(Симптомы).
	

%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

назначить_raw(Симптомы, Врачи):-
    кардиолог(Симптомы, Врачи);
    терапевт(Симптомы, Врачи);
    регистратура(Симптомы, Врачи);
	нефролог(Симптомы, Врачи);
	аллерголог(Симптомы, Врачи);
	флеболог(Симптомы, Врачи).

назначить(Симптомы,СписокВрачей):-
   findall(Врачи, назначить_raw(Симптомы,Врачи), СписокВрачей_raw),
   удалить_дубликат(СписокВрачей_raw, СписокВрачей).
